app/controllers/contactos_controller.rb

  def index
    @contactos = Contacto.all.reverse.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `contactos`

  def show
    @contacto = Contacto.find(params[:id])
---
SELECT * FROM `contactos` WHERE (`contactos`.`id` = 1)

  def edit
    @contacto = Contacto.find(params[:id])
---
SELECT * FROM `contactos` WHERE (`contactos`.`id` = 1)

  def create
    @contacto = Contacto.new(params[:contacto])

    UserMailer.deliver_correo_pagina(@contacto)

    respond_to do |format|
      if @contacto.save
---
INSERT INTO `contactos` (`nombre`, `tel`, `correo`, `mensaje`, `created_at`, `updated_at`) VALUES('sdfsdf', 'sdfsdf', 'ljksdjhfkjsdjd', 'sdfsdfjhkjhsdkjhkjhfkhksdkjhf', '2010-11-19 02:30:41', '2010-11-19 02:30:41')

  def destroy
    @contacto = Contacto.find(params[:id])
    @contacto.destroy
---
SELECT * FROM `contactos` WHERE (`contactos`.`id` = 4)
DELETE FROM `contactos` WHERE `id` = 4