app/controllers/eventos_controller.rb

SELECT * FROM `eventos`
---
  def index
    @eventos = Evento.all

SELECT * FROM `eventos` WHERE (`eventos`.`id` = 0)
---
  def show
    @evento = Evento.find(params[:id])

SELECT * FROM `eventos` WHERE (`eventos`.`id` = 1)
---
  def edit
    @evento = Evento.find(params[:id])

INSERT INTO "eventos" ("feventos_content_type", "created_at", "titulo", "updated_at", "descripcion", "feventos_file_name", "feventos_file_size", "feventos_updated_at") VALUES('image/png', '2012-01-26 00:13:30', 'evento', '2012-01-26 00:13:30', 'hola', '43741-mr-dormy-1920-1200.png', 478679, '2012-01-26 00:13:29')
---
  def create
    @evento = Evento.new(params[:evento])

    respond_to do |format|
      if @evento.save

SELECT * FROM `eventos` WHERE (`eventos`.`id` = 1)
UPDATE `eventos` SET `feventos_updated_at` = '2010-11-18 17:39:38', `updated_at` = '2010-11-18 17:39:41' WHERE `id` = 1
---
  def update
    @evento = Evento.find(params[:id])

    respond_to do |format|
      if @evento.update_attributes(params[:evento])