app/controllers/fotos_controller.rb

  def index
    @fotos = Foto.all
---
SELECT * FROM "fotos"

  def show
    @foto = Foto.find(params[:id])
---
SELECT * FROM "fotos" WHERE ("fotos"."id" = 1)

  def edit
    @foto = Foto.find(params[:id])
---
SELECT * FROM "fotos" WHERE ("fotos"."id" = 1)

  def create
    @foto = Foto.new(params[:foto])

    respond_to do |format|
      if @foto.save
---
INSERT INTO "fotos" ("created_at", "titulo", "updated_at", "imagen_content_type", "imagen_file_name", "imagen_file_size", "imagen_updated_at") VALUES('2012-01-26 00:27:01', 'foto', '2012-01-26 00:27:01', 'image/png', '43741-mr-dormy-1920-1200.png', 478679, '2012-01-26 00:27:00')

  def destroy
    @foto = Foto.find(params[:id])
    @foto.destroy
---
SELECT * FROM "fotos" WHERE ("fotos"."id" = 2)
DELETE FROM "fotos" WHERE "id" = 2