app/controllers/galerias_controller.rb

  def index
    @galerias = Galeria.all
---
SELECT * FROM `galerias`

  def show
    @galeria = Galeria.find(params[:id])
---
SELECT * FROM `galerias` WHERE (`galerias`.`id` = 1)

  def edit
    @galeria = Galeria.find(params[:id])
---
SELECT * FROM `galerias` WHERE (`galerias`.`id` = 1)

  def create
    @galeria = Galeria.new(params[:galeria])

    respond_to do |format|
      if @galeria.save
---
INSERT INTO "galerias" ("fgaleria_file_size", "created_at", "fgaleria_file_name", "titulo", "updated_at", "fgaleria_content_type", "descripcion", "fgaleria_updated_at") VALUES(478679, '2012-01-26 00:23:23', '43741-mr-dormy-1920-1200.png', 'imagen', '2012-01-26 00:23:23', 'image/png', 'hola', '2012-01-26 00:23:23')

  def update
    @galeria = Galeria.find(params[:id])

    respond_to do |format|
      if @galeria.update_attributes(params[:galeria])
---
SELECT * FROM `galerias` WHERE (`galerias`.`id` = 1)
UPDATE `galerias` SET `fgaleria_file_name` = 'patapon_3 copy.jpg', `fgaleria_content_type` = 'image/jpeg', `fgaleria_file_size` = 266261, `fgaleria_updated_at` = '2010-11-18 23:43:34', `updated_at` = '2010-11-18 23:43:36' WHERE `id` = 1