app/controllers/musicas_controller.rb

  def index
    @musicas = Musica.all
---
SELECT * FROM `musicas`

  def show
    @musica = Musica.find(params[:id])
---
SELECT * FROM `musicas` WHERE (`musicas`.`id` = 1)

  def edit
    @musica = Musica.find(params[:id])
---
SELECT * FROM `musicas` WHERE (`musicas`.`id` = 1)

  def create
    @musica = Musica.new(params[:musica])

    respond_to do |format|
      if @musica.save
---
INSERT INTO `musicas` (`titulo`, `created_at`, `updated_at`, `archivo_file_name`, `archivo_content_type`, `archivo_file_size`, `archivo_updated_at`) VALUES('musica 1', '2010-11-16 22:37:25', '2010-11-16 22:37:25', '1.mp3', 'audio/mpeg', 4119233, '2010-11-16 22:37:24')

  def update
    @musica = Musica.find(params[:id])

    respond_to do |format|
      if @musica.update_attributes(params[:musica])
---
SELECT * FROM `musicas` WHERE (`musicas`.`id` = 1)
UPDATE "musicas" SET "updated_at" = '2012-01-26 00:44:12', "archivo_updated_at" = '2012-01-26 00:44:12', "archivo_content_type" = 'audio/mp3', "archivo_file_name" = '2NE1 I AM THE BEST Choreography Practice (Uncut Ver.).MP3', "archivo_file_size" = 5007046 WHERE "id" = 1

  def destroy
    @musica = Musica.find(params[:id])
    @musica.destroy
---
SELECT * FROM `musicas` WHERE (`musicas`.`id` = 1)
DELETE FROM `musicas` WHERE `id` = 1