app/controllers/public_controller.rb

  def event
    @eventos= Evento.all.reverse
---
SELECT * FROM `eventos`

  def gallery

    @galeriasT= Galeria.all.reverse
---
SELECT * FROM `galerias`

  def photo
    @fotos = Foto.all.reverse
---
SELECT * FROM "fotos"