app/controllers/sliders_controller.rb

SELECT * FROM "sliders"
---
  def index
    @sliders = Slider.all

SELECT * FROM "sliders" WHERE ("sliders"."id" = 1)
---
  def show
    @slider = Slider.find(params[:id])

SELECT * FROM "sliders" WHERE ("sliders"."id" = 1)
---
  def edit
    @slider = Slider.find(params[:id])

INSERT INTO "sliders" ("created_at", "titulo", "updated_at", "imagen_content_type", "imagen_file_name", "imagen_file_size", "imagen_updated_at") VALUES('2012-01-26 00:38:51', 'fondo', '2012-01-26 00:38:51', 'image/png', '43741-mr-dormy-1920-1200.png', 478679, '2012-01-26 00:38:50')
---
  def create
    @slider = Slider.new(params[:slider])

    respond_to do |format|
      if @slider.save

SELECT * FROM "sliders" WHERE ("sliders"."id" = 1)
UPDATE "sliders" SET "updated_at" = '2012-01-26 00:40:29', "imagen_updated_at" = '2012-01-26 00:40:28' WHERE "id" = 1
---
  def update
    @slider = Slider.find(params[:id])

    respond_to do |format|
      if @slider.update_attributes(params[:slider])