app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '016731192c29500179657c3267270ba5eef01dda', '2010-11-21 22:37:19', 'bd74214d365a70933101308bfe30de73bc78ae34', NULL, '2010-11-21 22:37:19', NULL, 'admin', 'admin@admin.com')